[Killed] ObjectLiteral
src/main/pages/AdminListCommonsV2.jsx:25:6
     status: _status,
   } = useBackend([
     "/api/commons/allplus",
-  ], { method: "GET", url: "/api/commons/allplus" }, []);
+  ], {}, []);
 
   const deleteMutation = useBackendMutation(
killedBy: AdminListCommonsV2 tests renders three commons without crashing for admin user
statusReason: Unable to find an element with the text: /id: 1/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
src/main/pages/AdminListCommonsV2.jsx:33:33
     ["/api/commons/allplus"],
   );
 
-  const manage = (commonsId) => {
-    navigate(`/admin/editcommons/${commonsId}`);
-  };
+  const manage = (commonsId) => {};
 
   const leaderboard = (commonsId) => {
killedBy: AdminListCommonsV2 tests what happens when you click edit as an admin
statusReason: expected "spy" to be called with arguments: [ '/admin/editcommons/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/main/pages/AdminListCommonsV2.jsx:37:38
     navigate(`/admin/editcommons/${commonsId}`);
   };
 
-  const leaderboard = (commonsId) => {
-    navigate(`/leaderboard/${commonsId}`);
-  };
+  const leaderboard = (commonsId) => {};
 
   const announcements = (commonsId) => {
killedBy: AdminListCommonsV2 tests what happens when you click leaderboard as an admin
statusReason: expected "spy" to be called with arguments: [ '/leaderboard/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/main/pages/AdminListCommonsV2.jsx:41:40
     navigate(`/leaderboard/${commonsId}`);
   };
 
-  const announcements = (commonsId) => {
-    navigate(`/admin/announcements/${commonsId}`);
-  };
+  const announcements = (commonsId) => {};
 
   const onDeleteClick = (commonsId) => {
killedBy: AdminListCommonsV2 tests what happens when you click announcements as an admin
statusReason: expected "spy" to be called with arguments: [ '/admin/announcements/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/main/pages/AdminListCommonsV2.jsx:45:40
     navigate(`/admin/announcements/${commonsId}`);
   };
 
-  const onDeleteClick = (commonsId) => {
-    setCommonsToDelete(commonsId);
-    setShowModal(true);
-  };
+  const onDeleteClick = (commonsId) => {};
 
   const confirmDelete = () => {
killedBy: AdminListCommonsV2 tests what happens when you click delete, admin
statusReason: Unable to find an element by: [data-testid="AdminListCommonsV2-Modal-Delete"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
src/main/pages/AdminListCommonsV2.jsx:50:31
     setShowModal(true);
   };
 
-  const confirmDelete = () => {
-    if (!commonsToDelete) return;
-    const cellLike = { row: { values: { "commons.id": commonsToDelete } } };
-    deleteMutation.mutate(cellLike);
-    setShowModal(false);
-  };
+  const confirmDelete = () => {};
 
   return (
killedBy: AdminListCommonsV2 tests what happens when you click delete, admin
statusReason: expected "spy" to be called with arguments: [ 'Commons with id 1 was deleted' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />
