[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.jsx:37:57
 
   // *** SetCowHealth job ***
 
-  const objectToAxiosParamsSetCowHealthJob = (data) => ({
-    url: `/api/jobs/launch/setcowhealth?commonsID=${data.selectedCommons}&health=${data.healthValue}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsSetCowHealthJob = (data) => ({});
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:39:13
 
   const objectToAxiosParamsSetCowHealthJob = (data) => ({
     url: `/api/jobs/launch/setcowhealth?commonsID=${data.selectedCommons}&health=${data.healthValue}`,
-    method: "POST",
+    method: "",
   });
 
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:52:7
 
   const submitSetCowHealthJob = async (data) => {
     toast(
-      `Submitted Job: Set Cow Health (Commons: ${data.selectedCommonsName}, Health: ${data.healthValue})`,
+      ``,
     );
     SetCowHealthMutation.mutate(data);
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Submitted Job: Set Cow Health (Commons: Anika's Commons, Health: 10)",

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:60:10
   // *** UpdateCowHealth job ***
 
   const objectToAxiosParamsUpdateCowHealthJob = () => ({
-    url: `/api/jobs/launch/updatecowhealth`,
+    url: ``,
     method: "POST",
   });
killedBy: AdminJobsPage tests user can submit update cow health job for all commons
statusReason: expected '' to be '/api/jobs/launch/updatecowhealth' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:65:10
   });
 
   const objectToAxiosParamsUpdateCowHealthJobSingle = (data) => ({
-    url: `/api/jobs/launch/updatecowhealthsinglecommons?commonsId=${data.selectedCommons}`,
+    url: ``,
     method: "POST",
   });
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: expected '' to be '/api/jobs/launch/updatecowhealthsingl…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] EqualityOperator
src/main/pages/AdminJobsPage.jsx:84:9
   // Stryker restore all
 
   const submitUpdateCowHealthJob = async (data) => {
-    if (data.selectedCommonsName === "All Commons") {
+    if (data.selectedCommonsName !== "All Commons") {
       toast("Submitted Job: Update Cow Health");
       UpdateCowHealthMutation.mutate();
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: expected '/api/jobs/launch/updatecowhealth' to be '/api/jobs/launch/updatecowhealthsingl…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
src/main/pages/AdminJobsPage.jsx:84:9
   // Stryker restore all
 
   const submitUpdateCowHealthJob = async (data) => {
-    if (data.selectedCommonsName === "All Commons") {
+    if (false) {
       toast("Submitted Job: Update Cow Health");
       UpdateCowHealthMutation.mutate();
killedBy: AdminJobsPage tests user can submit update cow health job for all commons
statusReason: expected '/api/jobs/launch/updatecowhealthsingl…' to be '/api/jobs/launch/updatecowhealth' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:85:13
 
   const submitUpdateCowHealthJob = async (data) => {
     if (data.selectedCommonsName === "All Commons") {
-      toast("Submitted Job: Update Cow Health");
+      toast("");
       UpdateCowHealthMutation.mutate();
     } else {
killedBy: AdminJobsPage tests user can submit update cow health job for all commons
statusReason: expected "spy" to be called with arguments: [ 'Submitted Job: Update Cow Health' ]

Received: 

  1st spy call:

  [
-   "Submitted Job: Update Cow Health",

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.jsx:102:62
     method: "POST",
   });
 
-  const objectToAxiosParamsMilkTheCowsJobSingle = (data) => ({
-    url: `/api/jobs/launch/milkthecowjobsinglecommons?commonsId=${data.selectedCommons}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsMilkTheCowsJobSingle = (data) => ({});
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit milk the cows job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
src/main/pages/AdminJobsPage.jsx:122:9
   // Stryker restore all
 
   const submitMilkTheCowsJob = async (data) => {
-    if (data.selectedCommonsName === "All Commons") {
+    if (false) {
       toast("Submitted Job: Milk The Cows!");
       MilkTheCowsMutation.mutate();
killedBy: AdminJobsPage tests user can submit milk the cows job for all commons
statusReason: expected '/api/jobs/launch/milkthecowjobsinglec…' to be '/api/jobs/launch/milkthecowjob' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:157:15
   const objectToAxiosParamsInstructorReportSpecificCommonsJob = (data) => {
     return {
       url: `/api/jobs/launch/instructorreportsinglecommons?commonsId=${data.selectedCommons}`,
-      method: "POST",
+      method: "",
     };
   };
killedBy: AdminJobsPage tests user can submit instructor report (specific commons) job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:190:11
   // Stryker restore all
 
   const submitRecordCommonStatsJob = async () => {
-    toast("Submitted Job: Record Common Stats");
+    toast("");
     RecordCommonStatsMutation.mutate();
   };
killedBy: AdminJobsPage tests user can submit record common stats job
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Submitted Job: Record Common Stats",

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:204:13
       form: <SetCowHealthForm submitAction={submitSetCowHealthJob} />,
     },
     {
-      name: "Update Cow Health",
+      name: "",
       form: <UpdateCowHealthForm submitAction={submitUpdateCowHealthJob} />,
     },
killedBy: AdminJobsPage tests renders without crashing
statusReason: Unable to find an element with the text: Update Cow Health. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.jsx:207:5
       name: "Update Cow Health",
       form: <UpdateCowHealthForm submitAction={submitUpdateCowHealthJob} />,
     },
-    {
-      name: "Milk The Cows",
-      form: <MilkCowsJobForm submitAction={submitMilkTheCowsJob} />,
-    },
+    {},
     {
       name: "Instructor Report",
killedBy: AdminJobsPage tests renders without crashing
statusReason: Unable to find an element with the text: Milk The Cows. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:212:13
       form: <MilkCowsJobForm submitAction={submitMilkTheCowsJob} />,
     },
     {
-      name: "Instructor Report",
+      name: "",
       form: <InstructorReportForm submitAction={submitInstructorReportJob} />,
     },
killedBy: AdminJobsPage tests renders without crashing
statusReason: Unable to find an element with the text: Instructor Report. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.jsx:223:5
         />
       ),
     },
-    {
-      name: "Record Common Stats",
-      form: <RecordCommonStatsForm submitAction={submitRecordCommonStatsJob} />,
-    },
+    {},
   ];
 
killedBy: AdminJobsPage tests renders without crashing
statusReason: Unable to find an element with the text: Record Common Stats. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
