[Killed] ConditionalExpression
src/main/utils/dateUtils.js:68:7
   const currMonth = curr.getMonth() + 1;
   const currDate = curr.getDate();
 
-  if (startYear === currYear) {
+  if (true) {
     if (startMonth === currMonth) {
       return startDate > currDate;
killedBy: CommonsCard tests cannot join commons with future start date - future year
statusReason: expected "spy" to be called +0 times, but got 1 times
