[Killed] ArithmeticOperator
main/components/Chat/ChatDisplay.jsx:44:62
 
   // Stryker restore all
 
-  const sortedMessages = messagesPage.content.sort((a, b) => b.id - a.id);
+  const sortedMessages = messagesPage.content.sort((a, b) => b.id + a.id);
 
   const userIdToUsername = userCommonsList.reduce((acc, user) => {
killedBy: ChatDisplay tests sorts messages in descending order by id
statusReason: expect(element).toHaveAttribute("data-testid", "ChatMessageDisplay-3") // element.getAttribute("data-testid") === "ChatMessageDisplay-3"

Expected the element to have attribute:
  data-testid="ChatMessageDisplay-3"
Received:
  data-testid="ChatMessageDisplay-2"

[Killed] BlockStatement
main/components/Chat/ChatDisplay.jsx:46:66
 
   const sortedMessages = messagesPage.content.sort((a, b) => b.id - a.id);
 
-  const userIdToUsername = userCommonsList.reduce((acc, user) => {
-    acc[user.userId] = user.username;
-    return acc;
-  }, {});
+  const userIdToUsername = userCommonsList.reduce((acc, user) => {}, {});
 
   const totalElements = messagesPage.totalElements || 0;
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: Unable to find an element by: [data-testid="ChatMessageDisplay-1"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] LogicalOperator
main/components/Chat/ChatDisplay.jsx:51:25
     return acc;
   }, {});
 
-  const totalElements = messagesPage.totalElements || 0;
+  const totalElements = messagesPage.totalElements && 0;
   const hasMoreMessages = totalElements >= initialMessagePageSize;
 
killedBy: ChatDisplay tests boundary: shows view all link when totalElements is exactly 10
statusReason: Unable to find an element by: [data-testid="ChatDisplay-viewAll"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
    >

[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.jsx:51:25
     return acc;
   }, {});
 
-  const totalElements = messagesPage.totalElements || 0;
+  const totalElements = true;
   const hasMoreMessages = totalElements >= initialMessagePageSize;
 
killedBy: ChatDisplay tests boundary: shows view all link when totalElements is exactly 10
statusReason: Unable to find an element by: [data-testid="ChatDisplay-viewAll"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
    >

[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.jsx:52:27
   }, {});
 
   const totalElements = messagesPage.totalElements || 0;
-  const hasMoreMessages = totalElements >= initialMessagePageSize;
+  const hasMoreMessages = true;
 
   return (
killedBy: ChatDisplay tests does not show view all link when messages <= 10
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="ChatDisplay-viewAll"
  style="padding: 8px; text-align: center; background-color: rgb(248, 249, 250); border-bottom: 1px solid #dee2e6;"
>
  <a
    href="/chat/1"

[Killed] EqualityOperator
main/components/Chat/ChatDisplay.jsx:52:27
   }, {});
 
   const totalElements = messagesPage.totalElements || 0;
-  const hasMoreMessages = totalElements >= initialMessagePageSize;
+  const hasMoreMessages = totalElements < initialMessagePageSize;
 
   return (
killedBy: ChatDisplay tests does not show view all link when messages <= 10
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="ChatDisplay-viewAll"
  style="padding: 8px; text-align: center; background-color: rgb(248, 249, 250); border-bottom: 1px solid #dee2e6;"
>
  <a
    href="/chat/1"

[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.jsx:56:8
 
   return (
     <div data-testid="ChatDisplay">
-      {hasMoreMessages && (
-        <div
-          style={{
-            padding: "8px",
-            textAlign: "center",
-            backgroundColor: "#f8f9fa",
-            borderBottom: "1px solid #dee2e6",
-          }}
-          data-testid="ChatDisplay-viewAll"
-        >
-          <Link to={`/chat/${commonsId}`}>
-            View all {totalElements} messages
-          </Link>
-        </div>
-      )}
+      {false}
       <div
         style={{
killedBy: ChatDisplay tests boundary: shows view all link when totalElements is exactly 10
statusReason: Unable to find an element by: [data-testid="ChatDisplay-viewAll"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
    >

[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.jsx:56:8
 
   return (
     <div data-testid="ChatDisplay">
-      {hasMoreMessages && (
-        <div
-          style={{
-            padding: "8px",
-            textAlign: "center",
-            backgroundColor: "#f8f9fa",
-            borderBottom: "1px solid #dee2e6",
-          }}
-          data-testid="ChatDisplay-viewAll"
-        >
-          <Link to={`/chat/${commonsId}`}>
-            View all {totalElements} messages
-          </Link>
-        </div>
-      )}
+      {true}
       <div
         style={{
killedBy: ChatDisplay tests boundary: shows view all link when totalElements is exactly 10
statusReason: Unable to find an element by: [data-testid="ChatDisplay-viewAll"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
    >

[Killed] StringLiteral
main/components/Chat/ChatDisplay.jsx:61:30
           style={{
             padding: "8px",
             textAlign: "center",
-            backgroundColor: "#f8f9fa",
+            backgroundColor: "",
             borderBottom: "1px solid #dee2e6",
           }}
killedBy: ChatDisplay tests view all link container has correct styling
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- backgroundColor: rgb(248, 249, 250);
- borderBottom: 1px solid #dee2e6;
  padding: 8px;

[Killed] StringLiteral
main/components/Chat/ChatDisplay.jsx:62:27
             padding: "8px",
             textAlign: "center",
             backgroundColor: "#f8f9fa",
-            borderBottom: "1px solid #dee2e6",
+            borderBottom: "",
           }}
           data-testid="ChatDisplay-viewAll"
killedBy: ChatDisplay tests view all link container has correct styling
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- backgroundColor: rgb(248, 249, 250);
- borderBottom: 1px solid #dee2e6;
  padding: 8px;

[Killed] ObjectLiteral
main/components/Chat/ChatDisplay.jsx:72:16
         </div>
       )}
       <div
-        style={{
-          display: "flex",
-          flexDirection: "column-reverse",
-          overflowY: "scroll",
-          maxHeight: "300px",
-        }}
+        style={{}}
       >
         {Array.isArray(sortedMessages) &&
killedBy: ChatDisplay tests message list container has correct styles for scrolling and layout
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- display: flex;
- flexDirection: column-reverse;
- maxHeight: 300px;

[Killed] LogicalOperator
main/components/Chat/ChatDisplay.jsx:79:10
           maxHeight: "300px",
         }}
       >
-        {Array.isArray(sortedMessages) &&
-          sortedMessages.slice(0, initialMessagePageSize).map((message) => (
-            <ChatMessageDisplay
-              key={message.id}
-              message={{
-                ...message,
-                username: userIdToUsername[message.userId],
-              }}
-            />
-          ))}
+        {Array.isArray(sortedMessages) || sortedMessages.slice(0, initialMessagePageSize).map(message => <ChatMessageDisplay key={message.id} message={{
+  ...message,
+  username: userIdToUsername[message.userId]
+}} />)}
       </div>
     </div>
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: Unable to find an element by: [data-testid="ChatMessageDisplay-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
    >
