[Killed] ConditionalExpression
src/main/pages/ChatPage.jsx:48:22
   // Stryker restore all
 
   const sortedMessages = messagesPage.content.sort((a, b) => b.id - a.id);
-  const totalPages = messagesPage.totalPages || 0;
+  const totalPages = true;
   const totalElements = messagesPage.totalElements || 0;
 
killedBy: ChatPage tests shows empty state when no messages
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 1 of 1 (Total: 0 messages)
Received:
  Page 1 of (Total: 0 messages)

[Killed] LogicalOperator
src/main/pages/ChatPage.jsx:48:22
   // Stryker restore all
 
   const sortedMessages = messagesPage.content.sort((a, b) => b.id - a.id);
-  const totalPages = messagesPage.totalPages || 0;
+  const totalPages = messagesPage.totalPages && 0;
   const totalElements = messagesPage.totalElements || 0;
 
killedBy: ChatPage tests pagination controls show when multiple pages
statusReason: Unable to find an element by: [data-testid="pagination-first"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ChatPage.jsx:49:25
 
   const sortedMessages = messagesPage.content.sort((a, b) => b.id - a.id);
   const totalPages = messagesPage.totalPages || 0;
-  const totalElements = messagesPage.totalElements || 0;
+  const totalElements = true;
 
   const userIdToUsername = userCommonsList.reduce((acc, user) => {
killedBy: ChatPage tests shows empty state when no messages
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 1 of 1 (Total: 0 messages)
Received:
  Page 1 of 1 (Total: messages)

[Killed] ConditionalExpression
src/main/pages/ChatPage.jsx:49:25
 
   const sortedMessages = messagesPage.content.sort((a, b) => b.id - a.id);
   const totalPages = messagesPage.totalPages || 0;
-  const totalElements = messagesPage.totalElements || 0;
+  const totalElements = false;
 
   const userIdToUsername = userCommonsList.reduce((acc, user) => {
killedBy: ChatPage tests shows empty state when no messages
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 1 of 1 (Total: 0 messages)
Received:
  Page 1 of 1 (Total: messages)

[Killed] BlockStatement
src/main/pages/ChatPage.jsx:56:38
     return acc;
   }, {});
 
-  const handlePageChange = (page) => {
-    setCurrentPage(page);
-  };
+  const handlePageChange = (page) => {};
 
   const handlePageSizeChange = (e) => {
killedBy: ChatPage tests next button advances pages
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 2 of 3
Received:
  Page 1 of 3

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/main/pages/ChatPage.jsx:60:39
     setCurrentPage(page);
   };
 
-  const handlePageSizeChange = (e) => {
-    setPageSize(parseInt(e.target.value));
-    setCurrentPage(0); // reset to first page when page size changes
-  };
+  const handlePageSizeChange = (e) => {};
 
   const canGoPrevious = currentPage > 0;
killedBy: ChatPage tests changing page size triggers new API call with correct params
statusReason: expect(element).toHaveValue(20)

Expected the element to have value:
  20
Received:
  10

Ignored nodes: comments, script, style

[Killed] EqualityOperator
src/main/pages/ChatPage.jsx:65:25
     setCurrentPage(0); // reset to first page when page size changes
   };
 
-  const canGoPrevious = currentPage > 0;
+  const canGoPrevious = currentPage >= 0;
   const canGoNext = currentPage < totalPages - 1;
 
killedBy: ChatPage tests first/prev disabled on first page
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
  data-testid="pagination-first"
  type="button"
/>

[Killed] ConditionalExpression
src/main/pages/ChatPage.jsx:65:25
     setCurrentPage(0); // reset to first page when page size changes
   };
 
-  const canGoPrevious = currentPage > 0;
+  const canGoPrevious = false;
   const canGoNext = currentPage < totalPages - 1;
 
killedBy: ChatPage tests prev button goes backward
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 1 of 3
Received:
  Page 2 of 3

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/main/pages/ChatPage.jsx:66:21
   };
 
   const canGoPrevious = currentPage > 0;
-  const canGoNext = currentPage < totalPages - 1;
+  const canGoNext = false;
 
   return (
killedBy: ChatPage tests first/prev disabled on first page
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  class="btn btn-primary"
  data-testid="pagination-next"
  disabled=""
  type="button"

[Killed] EqualityOperator
src/main/pages/ChatPage.jsx:66:21
   };
 
   const canGoPrevious = currentPage > 0;
-  const canGoNext = currentPage < totalPages - 1;
+  const canGoNext = currentPage >= totalPages - 1;
 
   return (
killedBy: ChatPage tests first/prev disabled on first page
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  class="btn btn-primary"
  data-testid="pagination-next"
  disabled=""
  type="button"

[Killed] EqualityOperator
src/main/pages/ChatPage.jsx:84:40
             <option value={100}>100</option>
           </Form.Select>
           <small className="text-muted" data-testid="page-info">
-            Page {currentPage + 1} of {totalPages === 0 ? 1 : totalPages}{" "}
+            Page {currentPage + 1} of {totalPages !== 0 ? 1 : totalPages}{" "}
             (Total: {totalElements} messages)
           </small>
killedBy: ChatPage tests shows empty state when no messages
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 1 of 1 (Total: 0 messages)
Received:
  Page 1 of 0 (Total: 0 messages)

[Killed] ConditionalExpression
src/main/pages/ChatPage.jsx:84:40
             <option value={100}>100</option>
           </Form.Select>
           <small className="text-muted" data-testid="page-info">
-            Page {currentPage + 1} of {totalPages === 0 ? 1 : totalPages}{" "}
+            Page {currentPage + 1} of {false ? 1 : totalPages}{" "}
             (Total: {totalElements} messages)
           </small>
killedBy: ChatPage tests shows empty state when no messages
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 1 of 1 (Total: 0 messages)
Received:
  Page 1 of 0 (Total: 0 messages)

[Killed] ConditionalExpression
src/main/pages/ChatPage.jsx:95:10
           </Card.Body>
         </Card>
 
-        {!messagesLoading && sortedMessages.length === 0 && (
-          <Card className="text-center py-5">
-            <Card.Body>
-              <p className="text-muted" data-testid="no-messages">
-                No messages found.
-              </p>
-            </Card.Body>
-          </Card>
-        )}
+        {true}
 
         {!messagesLoading && sortedMessages.length > 0 && (
killedBy: ChatPage tests shows empty state when no messages
statusReason: Unable to find an element by: [data-testid="no-messages"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ChatPage.jsx:95:10
           </Card.Body>
         </Card>
 
-        {!messagesLoading && sortedMessages.length === 0 && (
+        {true && (
           <Card className="text-center py-5">
             <Card.Body>
killedBy: ChatPage tests displays messages when present
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p
  class="text-muted"
  data-testid="no-messages"
>
  No messages found.
</p> instead

[Killed] LogicalOperator
src/main/pages/ChatPage.jsx:105:10
           </Card>
         )}
 
-        {!messagesLoading && sortedMessages.length > 0 && (
-          <div data-testid="message-list">
-            {sortedMessages.map((message) => (
-              <div key={message.id} className="mb-2">
-                <ChatMessageDisplay
-                  message={{
-                    ...message,
-                    username: userIdToUsername[message.userId],
-                  }}
-                />
-              </div>
-            ))}
-          </div>
-        )}
+        {!messagesLoading && sortedMessages.length > 0 || <div data-testid="message-list">
+            {sortedMessages.map(message => <div key={message.id} className="mb-2">
+                <ChatMessageDisplay message={{
+      ...message,
+      username: userIdToUsername[message.userId]
+    }} />
+              </div>)}
+          </div>}
 
         {totalPages > 1 && (
killedBy: ChatPage tests shows empty state when no messages
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="message-list"
/> instead

[Killed] ConditionalExpression
src/main/pages/ChatPage.jsx:105:10
           </Card>
         )}
 
-        {!messagesLoading && sortedMessages.length > 0 && (
-          <div data-testid="message-list">
-            {sortedMessages.map((message) => (
-              <div key={message.id} className="mb-2">
-                <ChatMessageDisplay
-                  message={{
-                    ...message,
-                    username: userIdToUsername[message.userId],
-                  }}
-                />
-              </div>
-            ))}
-          </div>
-        )}
+        {true}
 
         {totalPages > 1 && (
killedBy: ChatPage tests displays messages when present
statusReason: Unable to find an element by: [data-testid="message-list"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
src/main/pages/ChatPage.jsx:107:33
 
         {!messagesLoading && sortedMessages.length > 0 && (
           <div data-testid="message-list">
-            {sortedMessages.map((message) => (
-              <div key={message.id} className="mb-2">
-                <ChatMessageDisplay
-                  message={{
-                    ...message,
-                    username: userIdToUsername[message.userId],
-                  }}
-                />
-              </div>
-            ))}
+            {sortedMessages.map(() => undefined)}
           </div>
         )}
killedBy: ChatPage tests displays messages when present
statusReason: Unable to find an element by: [data-testid="ChatMessageDisplay-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ChatPage.jsx:120:10
           </div>
         )}
 
-        {totalPages > 1 && (
+        {true && (
           <div className="d-flex justify-content-center align-items-center gap-3 mt-4 mb-4">
             <Button
killedBy: ChatPage tests pagination controls hidden when only one page
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-primary"
  data-testid="pagination-first"
  disabled=""
  type="button"
>

[Killed] EqualityOperator
src/main/pages/ChatPage.jsx:120:10
           </div>
         )}
 
-        {totalPages > 1 && (
+        {totalPages <= 1 && (
           <div className="d-flex justify-content-center align-items-center gap-3 mt-4 mb-4">
             <Button
killedBy: ChatPage tests pagination controls hidden when only one page
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-primary"
  data-testid="pagination-first"
  disabled=""
  type="button"
>

[Killed] ArrowFunction
src/main/pages/ChatPage.jsx:123:24
         {totalPages > 1 && (
           <div className="d-flex justify-content-center align-items-center gap-3 mt-4 mb-4">
             <Button
-              onClick={() => handlePageChange(0)}
+              onClick={() => undefined}
               disabled={!canGoPrevious}
               data-testid="pagination-first"
killedBy: ChatPage tests first button jumps to first page
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 1 of 5
Received:
  Page 3 of 5 (Total: 50 messages)

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
src/main/pages/ChatPage.jsx:124:25
           <div className="d-flex justify-content-center align-items-center gap-3 mt-4 mb-4">
             <Button
               onClick={() => handlePageChange(0)}
-              disabled={!canGoPrevious}
+              disabled={canGoPrevious}
               data-testid="pagination-first"
             >
killedBy: ChatPage tests first/prev disabled on first page
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
  data-testid="pagination-first"
  type="button"
/>

[Killed] ArrowFunction
src/main/pages/ChatPage.jsx:130:24
               First
             </Button>
             <Button
-              onClick={() => handlePageChange(currentPage - 1)}
+              onClick={() => undefined}
               disabled={!canGoPrevious}
               data-testid="pagination-prev"
killedBy: ChatPage tests prev button goes backward
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 1 of 3
Received:
  Page 2 of 3

Ignored nodes: comments, script, style

[Killed] ArithmeticOperator
src/main/pages/ChatPage.jsx:130:47
               First
             </Button>
             <Button
-              onClick={() => handlePageChange(currentPage - 1)}
+              onClick={() => handlePageChange(currentPage + 1)}
               disabled={!canGoPrevious}
               data-testid="pagination-prev"
killedBy: ChatPage tests prev button goes backward
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 1 of 3
Received:
  Page 3 of 3

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
src/main/pages/ChatPage.jsx:131:25
             </Button>
             <Button
               onClick={() => handlePageChange(currentPage - 1)}
-              disabled={!canGoPrevious}
+              disabled={canGoPrevious}
               data-testid="pagination-prev"
             >
killedBy: ChatPage tests first/prev disabled on first page
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
  data-testid="pagination-prev"
  type="button"
/>

[Killed] ArithmeticOperator
src/main/pages/ChatPage.jsx:137:21
               Previous
             </Button>
             <span data-testid="pagination-info">
-              Page {currentPage + 1} of {totalPages}
+              Page {currentPage - 1} of {totalPages}
             </span>
             <Button
killedBy: ChatPage tests pagination controls show when multiple pages
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 1 of 5
Received:
  Page -1 of 5

[Killed] ArrowFunction
src/main/pages/ChatPage.jsx:140:24
               Page {currentPage + 1} of {totalPages}
             </span>
             <Button
-              onClick={() => handlePageChange(currentPage + 1)}
+              onClick={() => undefined}
               disabled={!canGoNext}
               data-testid="pagination-next"
killedBy: ChatPage tests next button advances pages
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 2 of 3
Received:
  Page 1 of 3

Ignored nodes: comments, script, style

[Killed] ArithmeticOperator
src/main/pages/ChatPage.jsx:140:47
               Page {currentPage + 1} of {totalPages}
             </span>
             <Button
-              onClick={() => handlePageChange(currentPage + 1)}
+              onClick={() => handlePageChange(currentPage - 1)}
               disabled={!canGoNext}
               data-testid="pagination-next"
killedBy: ChatPage tests next button advances pages
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 2 of 3
Received:
  Page 0 of 3

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
src/main/pages/ChatPage.jsx:141:25
             </span>
             <Button
               onClick={() => handlePageChange(currentPage + 1)}
-              disabled={!canGoNext}
+              disabled={canGoNext}
               data-testid="pagination-next"
             >
killedBy: ChatPage tests first/prev disabled on first page
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  class="btn btn-primary"
  data-testid="pagination-next"
  disabled=""
  type="button"

[Killed] ArithmeticOperator
src/main/pages/ChatPage.jsx:147:47
               Next
             </Button>
             <Button
-              onClick={() => handlePageChange(totalPages - 1)}
+              onClick={() => handlePageChange(totalPages + 1)}
               disabled={!canGoNext}
               data-testid="pagination-last"
killedBy: ChatPage tests last button jumps to last page
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 5 of 5
Received:
  Page 7 of 5

Ignored nodes: comments, script, style

[Killed] ArrowFunction
src/main/pages/ChatPage.jsx:147:24
               Next
             </Button>
             <Button
-              onClick={() => handlePageChange(totalPages - 1)}
+              onClick={() => undefined}
               disabled={!canGoNext}
               data-testid="pagination-last"
killedBy: ChatPage tests last button jumps to last page
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 5 of 5
Received:
  Page 1 of 5

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
src/main/pages/ChatPage.jsx:148:25
             </Button>
             <Button
               onClick={() => handlePageChange(totalPages - 1)}
-              disabled={!canGoNext}
+              disabled={canGoNext}
               data-testid="pagination-last"
             >
killedBy: ChatPage tests first/prev disabled on first page
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  class="btn btn-primary"
  data-testid="pagination-last"
  disabled=""
  type="button"
