[Killed] ObjectLiteral
src/main/pages/AdminListCommonsV2.jsx:20:5
     status: _status,
   } = useBackend(
     ["/api/commons/allplus"],
-    { method: "GET", url: "/api/commons/allplus" },
+    {},
     [],
   );
killedBy: AdminListCommonsV2 tests renders three commons without crashing for admin user
statusReason: Unable to find an element with the text: /id: 1/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
src/main/pages/AdminListCommonsV2.jsx:36:40
     navigate(`/admin/announcements/${commonsId}`);
   };
 
-  const onDeleteClick = (commonsId) => {
-    if (window.confirm("Are you sure you want to delete this commons?")) {
-      toast(`Commons with id ${commonsId} deleted`);
-    }
-  };
+  const onDeleteClick = (commonsId) => {};
 
   return (
killedBy: AdminListCommonsV2 tests what happens when you click delete and confirm, admin
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminListCommonsV2.jsx:37:74
   };
 
   const onDeleteClick = (commonsId) => {
-    if (window.confirm("Are you sure you want to delete this commons?")) {
-      toast(`Commons with id ${commonsId} deleted`);
-    }
+    if (window.confirm("Are you sure you want to delete this commons?")) {}
   };
 
killedBy: AdminListCommonsV2 tests what happens when you click delete and confirm, admin
statusReason: expected "spy" to be called with arguments: [ 'Commons with id 1 deleted' ]

Number of calls: 0
