[Killed] ArrowFunction
src/main/pages/PlayPage.jsx:178:22
         <Container>
           <Button
             variant="outline-secondary"
-            onClick={() => navigate("/selectCommons")}
+            onClick={() => undefined}
             className="mb-3"
             data-testid="select-commons-button"
killedBy: PlayPage tests clicking Select Another Commons navigates to /selectCommons
statusReason: expected "spy" to be called with arguments: [ '/selectCommons' ]

Number of calls: 0

[Killed] BooleanLiteral
src/main/pages/PlayPage.jsx:185:12
             Select Another Commons
           </Button>
 
-          {!commonsPlus && <h1>This commons does not exist!</h1>}
+          {commonsPlus && <h1>This commons does not exist!</h1>}
           {notallowed && <h1>You have yet to join this commons!</h1>}
           {allowed && !!currentUser && (
killedBy: PlayPage tests click buy button
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1>
  This commons does not exist!
</h1> instead

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:185:12
             Select Another Commons
           </Button>
 
-          {!commonsPlus && <h1>This commons does not exist!</h1>}
+          {true}
           {notallowed && <h1>You have yet to join this commons!</h1>}
           {allowed && !!currentUser && (
killedBy: PlayPage tests User not allowed to access a commons that does not exist
statusReason: Unable to find an element with the text: This commons does not exist!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:187:12
 
           {!commonsPlus && <h1>This commons does not exist!</h1>}
           {notallowed && <h1>You have yet to join this commons!</h1>}
-          {allowed && !!currentUser && (
+          {allowed || !!currentUser && (
             <CommonsPlay currentUser={currentUser} />
           )}
killedBy: PlayPage tests User that has not joined any commons is trying to access an unjoined common
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="woodentitle card"
  data-testid="commons-card"
>
  <div
    class="text-center border-0 my-3"

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:198:12
             />
           )}
           <br />
-          {!!userCommons && !!commonsPlus && (
-            <CardGroup>
-              <ManageCows
-                userCommons={userCommons}
-                commons={commonsPlus.commons}
-                setMessage={setMessage}
-                openModal={openModal}
-              />
-              <FarmStats userCommons={userCommons} />
-              <Profits userCommons={userCommons} profits={userCommonsProfits} />
-              <ManageCowsModal
-                number={numCows}
-                setNumber={setNumCows}
-                userCommons={userCommons}
-                isOpen={isModalOpen}
-                message={message}
-                onClose={closeModal}
-                onBuy={onBuy}
-                onSell={onSell}
-              />
-            </CardGroup>
-          )}
+          {false}
         </Container>
       </BasicLayout>
killedBy: PlayPage tests click buy button
statusReason: Unable to find an element by: [data-testid="buy-cow-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:222:8
           )}
         </Container>
       </BasicLayout>
-      {(hasRole(currentUser, "ROLE_ADMIN") ||
-        (!!commonsPlus && commonsPlus.commons.showChat)) && (
-        <div style={chatContainerStyle} data-testid="playpage-chat-div">
-          {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
-          <Button
-            style={chatButtonStyle}
-            onClick={toggleChatWindow}
-            data-testid="playpage-chat-toggle"
-          >
-            {isChatOpen ? (
-              <span style={emojiStyle} data-testid="close-icon">
-                ❌
-              </span>
-            ) : (
-              <span style={emojiStyle} data-testid="message-icon">
-                💬
-              </span>
-            )}
-          </Button>
-        </div>
-      )}
+      {hasRole(currentUser, "ROLE_ADMIN") || !!commonsPlus && commonsPlus.commons.showChat || <div style={chatContainerStyle} data-testid="playpage-chat-div">
+          {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
+          <Button style={chatButtonStyle} onClick={toggleChatWindow} data-testid="playpage-chat-toggle">
+            {isChatOpen ? <span style={emojiStyle} data-testid="close-icon">
+                ❌
+              </span> : <span style={emojiStyle} data-testid="message-icon">
+                💬
+              </span>}
+          </Button>
+        </div>}
     </div>
   );
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Unable to find an element by: [data-testid="playpage-chat-toggle"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:222:9
           )}
         </Container>
       </BasicLayout>
-      {(hasRole(currentUser, "ROLE_ADMIN") ||
-        (!!commonsPlus && commonsPlus.commons.showChat)) && (
+      {(true) && (
         <div style={chatContainerStyle} data-testid="playpage-chat-div">
           {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
killedBy: PlayPage tests Doesn't show chat button for non-admins if showChat is false
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-primary"
  data-testid="playpage-chat-toggle"
  style="width: 60px; height: 60px; border-radius: 25%; background-color: lightblue; color: black; position: fixed; bottom: 30px; right: 30px;"
  type="button"
>
