[Killed] StringLiteral
src/main/pages/SelectCommonsPage.jsx:28:10
   // Stryker restore all
 
   const objectToAxiosParams = (newCommonsId) => ({
-    url: "/api/commons/join",
+    url: "",
     method: "POST",
     params: {
killedBy: HomePage tests Calls the callback when you click join
statusReason: expected '' to be '/api/commons/join' // Object.is equality

[Killed] StringLiteral
src/main/pages/SelectCommonsPage.jsx:64:20
 
   return (
     <div
-      data-testid={"HomePage-main-div"}
+      data-testid={""}
       style={{ backgroundSize: "cover", backgroundImage: `url(${Background})` }}
     >
killedBy: HomePage tests renders without crashing when lists return empty list
statusReason: Unable to find an element by: [data-testid="HomePage-main-div"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid=""
      style="background-size: cover; background-image: url(/src/assets/HomePageBackground-night.jpg);"

[Killed] StringLiteral
src/main/pages/SelectCommonsPage.jsx:65:32
   return (
     <div
       data-testid={"HomePage-main-div"}
-      style={{ backgroundSize: "cover", backgroundImage: `url(${Background})` }}
+      style={{ backgroundSize: "", backgroundImage: `url(${Background})` }}
     >
       <BasicLayout>
killedBy: HomePage tests Home page intro card has the correct styles applied
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- backgroundSize: cover;
