[Killed] BlockStatement
src/main/pages/DeveloperPage.jsx:6:29
 import { useSystemInfo } from "main/utils/systemInfo";
 import { Inspector } from "react-inspector";
 
-const DeveloperPage = () => {
-  const { data: systemInfo } = useSystemInfo();
-
-  return (
-    <BasicLayout>
-      <h2>Developer Info</h2>
-      <p>
-        <strong>Source Code: </strong>
-        <a
-          href={systemInfo?.sourceRepo}
-          target="_blank"
-          rel="noopener noreferrer"
-          data-testid="developer-page-source-link"
-        >
-          {systemInfo?.sourceRepo}
-        </a>
-      </p>
-      <h3>System Information</h3>
-      <div data-testid="developer-page-system-info">
-        <Inspector data={systemInfo} />
-      </div>
-    </BasicLayout>
-  );
-};
+const DeveloperPage = () => {};
 
 export default DeveloperPage;
killedBy: DeveloperPage tests renders without crashing
statusReason: Unable to find an element with the text: Developer Info. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] OptionalChaining
src/main/pages/DeveloperPage.jsx:15:17
       <p>
         <strong>Source Code: </strong>
         <a
-          href={systemInfo?.sourceRepo}
+          href={systemInfo.sourceRepo}
           target="_blank"
           rel="noopener noreferrer"
killedBy: DeveloperPage tests renders correctly when systemInfo is null
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] OptionalChaining
src/main/pages/DeveloperPage.jsx:20:12
           rel="noopener noreferrer"
           data-testid="developer-page-source-link"
         >
-          {systemInfo?.sourceRepo}
+          {systemInfo.sourceRepo}
         </a>
       </p>
killedBy: DeveloperPage tests renders correctly when systemInfo is null
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document
